api-fablab/app/controllers/api/v1/maquinas_controller.rb

SELECT "maquinas".* FROM "maquinas"
---
  def index
    @maquinas = Maquina.all

UPDATE "maquinas" SET "nome_tecnico" = 'Impressora 3D blá blá', "updated_at" = '2025-01-28 15:05:49.326565' WHERE "maquinas"."id" = 1
---
  def update
    if @maquina.update(maquina_params)

SELECT "maquinas".* FROM "maquinas" WHERE "maquinas"."id" = 1 LIMIT 1
---
    def set_maquina
      @maquina = Maquina.find(params.expect(:id))