api-fablab/app/controllers/api/v1/usuarios_controller.rb

UPDATE "usuarios" SET "cpf" = '01234567890', "tipo" = 'Admin', "updated_at" = '2025-01-28 14:10:41.985018' WHERE "usuarios"."id" = 1
---
  def update
    if @usuario.update(usuario_params)

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params.expect(:id))